Catalogs/ИзделияЭлемент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияЭлемент</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБезАртикула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/АктуальныеИзделияКомплектыЭлементы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АктуальныеИзделияКомплектыЭлементы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплектЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КартинкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КартинкиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеЭлемент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РекламацияПодряда</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачиОбщие</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Листовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поганажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штучная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Массив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияЗаказчика</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещенияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПоТЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВДоговоре</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Образец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Образец</v8:Type>
								<v8:Type>cfg:CatalogRef.ПредварительныйОбразец</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Помещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Помещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБезКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИзделияЭлемент/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//&НаКлиенте
//Перем РасписаниеИзменено; 
 
&НаКлиенте
Перем КолонкаИзменена, НачальноеЗначениеНомерПоПорядку, НомерПомещения, ПрефиксСделки; 
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Объект") Тогда
		Объект.Проект = Параметры.Проект;
	КонецЕсли;
	
	ОбновитьКартинки();
	Элементы.АдресКартинки.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	Если НЕ ПустаяСтрока(Объект.Артикул) Тогда
		Объект.Наименование = СокрЛП(СтрЗаменить(Объект.Наименование,Объект.Артикул + ".",""));
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Ключ.Пустая() Тогда
		Объект.Количество = 1; 
		ОбъектНастройки = Отчеты.ОбщиеНастройки.Создать();
		Объект.ЕдиницаИзмерени = омЕдиницыИзмерения.ПолучитьЕдиницуПоУмолчанию(ОбъектНастройки.ПолучитьНаименованиеРеквизитаЕдиницы(Перечисления.ТипыНоменклатуры.Штучная));
	Иначе
		ПолучитьЭлементСделки();
		//ЭтаФорма.ТекущийЭтап = Справочники.ИзделияЭлемент.ПолучитьТекущийЭтапИзделия(Объект.Ссылка);
		ЗаполнитьКомплекты();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Помещения) Тогда
		ЭтаФорма.Элементы.Помещения.СписокВыбора.Добавить(Объект.Помещения);
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктуальныеИзделияКомплектыЭлементы.ПриложениеКДоговору КАК ПриложениеКДоговору
		|ИЗ
		|	РегистрСведений.АктуальныеИзделияКомплектыЭлементы КАК АктуальныеИзделияКомплектыЭлементы
		|ГДЕ
		|	АктуальныеИзделияКомплектыЭлементы.ИзделиеКомплектЭлемент = &ИзделиеКомплектЭлемент";
	
	Запрос.УстановитьПараметр("ИзделиеКомплектЭлемент", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.ПриложениеКДоговору = Выборка.ПриложениеКДоговору;
		ЭтаФорма.Актуальность = Истина;
		ЭтаФорма.Элементы.Актуальность.Видимость = Истина;
	КонецЦикла;
	

	
	//ЗаполнитьЭтапыРасписанияПлан();
	
    // СтандартныеПодсистемы.РаботаСФайлами
    ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
    ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
    РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
    // Конец СтандартныеПодсистемы.РаботаСФайлами
    
КонецПроцедуры 

&НаСервере
Процедура ПолучитьЭлементСделки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлементыСделкиИзделияЗаказчика.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ЭлементыСделкиИзделияЗаказчика
		|ГДЕ
		|	ЭлементыСделкиИзделияЗаказчика.ИзделиеЭлемент = &ИзделиеЭлемент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = &ИзделиеЭлемент";
	
	Запрос.УстановитьПараметр("ИзделиеЭлемент", Объект.Ссылка);

	ПакетРезультат = Запрос.ВыполнитьПакет();
	Выборка = ПакетРезультат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.ИзделиеЗаказчика = Выборка.Ссылка;
	КонецЦикла;
	
	Выборка = ПакетРезультат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.ИзделиеКомплект = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЭлементСделки()  

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	СформироватьАртикул();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинки()	
	КлючКартинки = РегистрыСведений.КартинкиНоменклатуры.СоздатьКлючЗаписи(Новый Структура("ИзделиеЭлемент", Объект.Ссылка));
	АдресКартинки = ПолучитьНавигационнуюСсылку(КлючКартинки, "Картинка");
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		ПроверитьКаталогИзделия(Объект.Ссылка,Объект.Проект);	
		Оповестить("ИзменилосьИзделие",Новый Структура("Изделие,Проект",Объект.Ссылка,Объект.Проект),ЭтаФорма);
		
		Если НЕ НачальноеЗначениеНомерПоПорядку = Объект.НомерПоПорядку Тогда
			
			ИзменитьНумерациюНаСервере(Объект.Проект, НачальноеЗначениеНомерПоПорядку, Объект.НомерПоПорядку, Объект.Ссылка);	
			Оповестить("ИзменилсяПорядокИзделий");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьНумерациюНаСервере(Сделка, НачальноеЗначениеНомерПоПорядку, ТекущиеЗначение, ИзделиеЗаказчика)
	
	
	Если НачальноеЗначениеНомерПоПорядку = 0 Тогда
		НачальныйНомер 	= ТекущиеЗначение;
		КонечныйНомер  	= омИзделиеЭлемент.ПолучитьМаксимальныйНомерИзделия(Сделка);
		Корректировка 	= 0;
	ИначеЕсли НачальноеЗначениеНомерПоПорядку > ТекущиеЗначение Тогда
		НачальныйНомер 	= ТекущиеЗначение;
		КонечныйНомер  	= НачальноеЗначениеНомерПоПорядку;
		Корректировка 	= 1;
	Иначе
		НачальныйНомер 	= НачальноеЗначениеНомерПоПорядку;
		КонечныйНомер  	= ТекущиеЗначение;
		Корректировка 	= 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЭлемент.Ссылка КАК ИзделиеЭлемент,
		|	ИзделияЭлемент.НомерПоПорядку КАК НомерПоПорядку,
		|	ИзделияЭлемент.Помещения.НомерПомещения КАК НомерПомещения,
		|	ИзделияЭлемент.Проект.Префикс КАК СделкаПрефикс,
		|	ЕСТЬNULL(ИзделияКомплектИзделияЗаказчика.Основное, ЛОЖЬ) КАК ИзделияЗаказчикаОсновное,
		|	ИзделияКомплектИзделияЗаказчика.Ссылка КАК ИзделияКомплект
		|ИЗ
		|	Справочник.ИзделияЭлемент КАК ИзделияЭлемент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЗаказчика
		|		ПО (ИзделияКомплектИзделияЗаказчика.ИзделиеЭлемент = ИзделияЭлемент.Ссылка)
		|ГДЕ
		|	ИзделияЭлемент.Проект = &Проект
		|	И ИзделияЭлемент.НомерПоПорядку <= &КонечныйНомер
		|	И ИзделияЭлемент.НомерПоПорядку >= &НачальныйНомер
		|	И ИзделияЭлемент.Ссылка <> &ИзделиеЭлемент
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПоПорядку";
	
	Запрос.УстановитьПараметр("НачальныйНомер", НачальныйНомер);
	Запрос.УстановитьПараметр("ИзделиеЭлемент", ИзделиеЗаказчика);
	Запрос.УстановитьПараметр("КонечныйНомер", КонечныйНомер);
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачальныйНомер = НачальныйНомер + Корректировка;
	
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.НомерПоПорядку = НачальныйНомер Тогда
			
			обИзделиеЭлемент = Выборка.ИзделиеЭлемент.ПолучитьОбъект();
			
			обИзделиеЭлемент.НомерПоПорядку = НачальныйНомер;
			обИзделиеЭлемент.Артикул = омИзделиеЭлементНаКлиентеСервере.СобратьАртикулИзДанных(Выборка.СделкаПрефикс, Выборка.НомерПомещения, обИзделиеЭлемент.НомерПоПорядку);
			обИзделиеЭлемент.Наименование = обИзделиеЭлемент.Артикул + "." + обИзделиеЭлемент.НаименованиеБезАртикула;
			
			обИзделиеЭлемент.Записать(); 
			
			Если Выборка.ИзделияЗаказчикаОсновное Тогда
				
				обИзделиеКомплект = Выборка.ИзделияКомплект.ПолучитьОбъект();	
				
				омИзделиеКомплектНаКлиентеСервере.СформироватьПолноеНаименование(обИзделиеКомплект);
				
				обИзделиеКомплект.Записать();
			КонецЕсли;
		КонецЕсли; 
		
		
		НачальныйНомер = НачальныйНомер + 1;
	КонецЦикла;
	
	

КонецПроцедуры // ИзменитьНумерациюНаСервере()

&НаСервереБезКонтекста
Процедура ПроверитьКаталогИзделия(СсылкаНаИзделие,ОбъектИзделия)
	
	Справочники.ИзделияЭлемент.ПроверитьКаталогИзделия(СсылкаНаИзделие,ОбъектИзделия);		
	
КонецПроцедуры // ПроверитьРасположениеОбъекта()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Добавлена картинка" Тогда
		Если Параметр = Объект.Ссылка Тогда
			ПодключитьОбработчикОжидания("ПослеЗагрузкиКартинки",0.5,Истина);
		КонецЕсли;
	КонецЕсли;
    // СтандартныеПодсистемы.РаботаСФайлами
    РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
    // Конец СтандартныеПодсистемы.РаботаСФайлами
КонецПроцедуры

&НаКлиенте
Асинх Процедура АдресКартинкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.Параметры.Ключ.Пустая() Тогда
		ПоказатьПредупреждение(,"Перед добавлением картинки необходимо сохранить изделие.");
		Возврат;	
	КонецЕсли;
	
	Если НЕ ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СсылкаНаФайл") Тогда
		Возврат;	
	КонецЕсли;
	
	мДопустимоеРасширениеФайлов = Новый Массив;
	мДопустимоеРасширениеФайлов.Добавить(".png");
	мДопустимоеРасширениеФайлов.Добавить(".jpg");
	мДопустимоеРасширениеФайлов.Добавить(".jpeg");
	
	ПолноеИмя = ПараметрыПеретаскивания.Значение.Файл.ПолноеИмя;
	ФайлКартинки = Новый Файл(ПолноеИмя);
	РасширениеФайла = НРег(ФайлКартинки.Расширение);
	Если мДопустимоеРасширениеФайлов.Найти(РасширениеФайла) = Неопределено Тогда
		Возврат;
	КонецЕсли;

	
	РазмерФайла = Окр(ФайлКартинки.Размер() / (1024*1024),1);
	МаксимальныйРазмерФайла = Окр(ПолучитьМаксимальныйРазмерФайла() / (1024*1024),1);
	Если РазмерФайла > МаксимальныйРазмерФайла Тогда
		ПоказатьПредупреждение(,"Размер файла " + РазмерФайла + " Мб. Максимальный допустимый размер файла " + МаксимальныйРазмерФайла + "Мб.");
		Возврат;	
	КонецЕсли; 
	
	ПомещенныйФайл = Ждать ПоместитьФайлНаСерверАсинх(,,,ПолноеИмя);
	
	ЗаписатьФайлКартинкиНаСервере(Объект.Ссылка, ПомещенныйФайл.Адрес, ПолноеИмя);
	
	ПодключитьОбработчикОжидания("ПослеЗагрузкиКартинки",0.5,Истина);
	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗагрузкиКартинки() Экспорт

	ОбновитьКартинки();	
	Элементы.АдресКартинки.Обновить();

КонецПроцедуры // ПослеЗагрузкиКартинки()


&НаСервереБезКонтекста
Функция ЗаписатьФайлКартинкиНаСервере(ИзделиеЗаказчика, АдресВХ, ИмяФайла)

	МЗ = РегистрыСведений.КартинкиНоменклатуры.СоздатьМенеджерЗаписи();
	МЗ.ИзделиеЭлемент = ИзделиеЗаказчика;
	МЗ.ИмяФайла = ИмяФайла;
	МЗ.Картинка = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХ));
	МЗ.Записать();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМаксимальныйРазмерФайла()

	Возврат РаботаСФайлами.МаксимальныйРазмерФайла();	

КонецФункции // ПолучитьМаксимальныйРазмерФайла()

&НаКлиенте
Процедура АдресКартинкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПомещенияОбъекта(Проект)
	Возврат Справочники.Помещения.ПолучитьПомещенияОбъекта(Проект);
КонецФункции // ПолучитьПомещенияОбъекта()

&НаСервереБезКонтекста
Функция ПолучитьНомерКода(Проект)
	
	текЗначение = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(НомерИзделияПоПорядку.НомерПоПорядку), 0) КАК НомерПоПорядку
		|ИЗ
		|	РегистрСведений.НомерИзделияПоПорядку КАК НомерИзделияПоПорядку
		|ГДЕ
		|	НомерИзделияПоПорядку.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		текЗначение = Выборка.НомерПоПорядку;
	КонецЦикла;

	Возврат текЗначение + 1;
КонецФункции

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	ПолучитьПрефиксСделки();

	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		Элементы.Помещения.СписокВыбора.ЗагрузитьЗначения(ПолучитьПомещенияОбъекта(Объект.Проект));
		Объект.НомерПоПорядку = ПолучитьномерПоПорядку(Объект.Проект);
	Иначе
		Объект.Помещения = ПредопределенноеЗначение("Справочник.Помещения.ПустаяСсылка");
		Объект.НомерПоПорядку = 0;
	КонецЕсли;
	
	СформироватьАртикул(); 
	
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьномерПоПорядку(Сделка)

	текНомер = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ИзделияЭлемент.НомерПоПорядку), 0) + 1 КАК НомерПоПорядку
		|ИЗ
		|	Справочник.ИзделияЭлемент КАК ИзделияЭлемент
		|ГДЕ
		|	ИзделияЭлемент.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		текНомер = Выборка.НомерПоПорядку;
	КонецЦикла;
	
	Возврат текНомер;

КонецФункции // ПолучитьномерПоПорядку()

&НаСервере
Процедура ЗаполнитьКомплекты()
	
	стКомплекты = омКомплекты.КомплектыИзИзделияЭлементы(Объект.Ссылка);	
	
	Для каждого х Из стКомплекты.мИзделияКомплект Цикл
		ЭтаФорма.СписокКомплектов.Добавить(х);
	КонецЦикла; 
	

КонецПроцедуры // ЗаполнитьКомплекты()

&НаКлиенте
Процедура СформироватьАртикул()

	Объект.Артикул = омИзделиеЭлементНаКлиентеСервере.СобратьАртикулИзДанных(ПрефиксСделки, НомерПомещения, Объект.НомерПоПорядку);
	Объект.Наименование = Объект.Артикул + "." + Объект.НаименованиеБезАртикула;

КонецПроцедуры // СформироватьАртикул()

&НаКлиенте
Процедура ПомещенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.Помещения.СписокВыбора.ЗагрузитьЗначения(ПолучитьПомещенияОбъекта(Объект.Проект));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭтапыРасписанияПлан()
	//стЭтапы = РегистрыСведений.ПоследовательностьЭтаповКанбан.ПолучитьЭтапыКанбана(Объект.НомерВерсииКанбан,,Истина);
	стЭтапы = РегистрыСведений.ПоследовательностьЭтаповКанбан.ПолучитьЭтапыКанбана(-1,,Истина);
	
	//Если стЭтапы = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	
	//Объект.НомерВерсииКанбан = стЭтапы.НомерВерсииВкладокЭтапыКанбан;
	мЭтапы = стЭтапы.мЭтапы;
	
	КоличествоСтрокВТаблице = Объект.РасписаниеПлан.Количество();
	КоличествоСтрокЭтапы = мЭтапы.Количество() - 1;
	
	Если Объект.РасписаниеПлан.Количество() = 0 Тогда
		ЗаполнитьРасписание(мЭтапы);
	Иначе
		тзВр = Объект.РасписаниеПлан.Выгрузить();
		Объект.РасписаниеПлан.Очистить();
		
		Для индекс = 0 По КоличествоСтрокЭтапы Цикл
			текЭтап = мЭтапы[индекс];
			НайденаяСтрока = тзВр.Найти(текЭтап,"Этап");
			Если НайденаяСтрока = Неопределено Тогда
				НС = Объект.РасписаниеПлан.Добавить();
				НС.Этап 	= текЭтап;
				НС.Процент 	= 0;
			Иначе
				ЗаполнитьЗначенияСвойств(Объект.РасписаниеПлан.Добавить(),НайденаяСтрока);
			КонецЕсли;	
		КонецЦикла;
		ЗаполнитьРасписание(Неопределено);
	КонецЕсли;
КонецПроцедуры // ЗаполнитьЭтапыРасписанияПлан()

&НаСервере
Процедура ЗаполнитьРасписание(мЭтапы)
	
	
	Если мЭтапы = Неопределено Тогда
		тзЭтапы = Объект.РасписаниеПлан.Выгрузить();
		ИзТЗ = Истина;
	Иначе	
		тзЭтапы = Новый ТаблицаЗначений;
		тзЭтапы.Колонки.Добавить("Этап",Новый ОписаниеТипов("СправочникСсылка.ЭтапыКанбан"));
		тзЭтапы.Колонки.Добавить("Процент",Новый ОписаниеТипов("Число"));
		
		Для х = 1 По мЭтапы.Количество() Цикл
			тзЭтапы.Добавить();			
		КонецЦикла;
		тзЭтапы.ЗагрузитьКолонку(мЭтапы,"Этап");
		ИзТЗ = Ложь;
	КонецЕсли;
	
	ПромДерево = РеквизитФормыВЗначение("Расписание");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тз.Этап КАК Этап,
		|	тз.Процент КАК Процент
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	&тзЭтапы КАК тз
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоследовательностьЭтаповКанбан.Стадия КАК Стадия,
		|	ПоследовательностьЭтаповКанбан.Стадия КАК СтадияКонтроль,
		|	0 КАК Продолжительность,
		|	ВЫБОР
		|		КОГДА &ИзТЗ
		|			ТОГДА вт.Процент
		|		ИНАЧЕ ПоследовательностьЭтаповКанбан.ЭтапКанбан.ПроцентВСтадии
		|	КОНЕЦ КАК Процент,
		|	вт.Этап КАК Этап
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоследовательностьЭтаповКанбан КАК ПоследовательностьЭтаповКанбан
		|		ПО вт.Этап = ПоследовательностьЭтаповКанбан.ЭтапКанбан
		|ИТОГИ
		|	СУММА(Процент)
		|ПО
		|	Стадия";
	
	
	Запрос.УстановитьПараметр("тзЭтапы",тзЭтапы);       
	Запрос.УстановитьПараметр("ИзТЗ",ИзТЗ);    
	Результат = Запрос.Выполнить();
	
	ПромДерево = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЗначениеВРеквизитФормы(ПромДерево, "Расписание");	
	
	
КонецПроцедуры // ЗаполнитьРасписание()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РасписаниеИзменено 	= Ложь;
	КолонкаИзменена 	= "РасписаниеПродолжительность";
	
	НачальноеЗначениеНомерПоПорядку = Объект.НомерПоПорядку;
	
	ЭлементыДерева = Расписание.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Для каждого СтрокаСтадия Из Объект.Стадии Цикл
			Если СтрокаСтадия.Стадия = ЭлементДерева.Стадия Тогда
			    ЭлементДерева.Продолжительность = СтрокаСтадия.Продолжительность;
				Прервать;	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ПромДерево = ЭтаФорма.Расписание.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ПромДерево Цикл
		Элементы.Расписание.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);

		ЭлементыУр2 = ЭлементДерева.ПолучитьЭлементы();
		Для Каждого ЭлементУр2 Из ЭлементыУр2 Цикл
			ЭлементУр2.Стадия = ЭлементУр2.Этап;
		КонецЦикла;
	КонецЦикла;
	
	ПолучитьПрефиксСделки();
	ПолучитьНомерПомещения();
	
	РасписаниеПриИзменении(0);
    // СтандартныеПодсистемы.РаботаСФайлами
    РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
    // Конец СтандартныеПодсистемы.РаботаСФайлами    
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНомерПомещения()
	Если ЗначениеЗаполнено(Объект.Помещения) Тогда
		НомерПомещения = ПолучитьНомерПомещенияНаСервере(Объект.Помещения);
	Иначе
		НомерПомещения = "";	
	КонецЕсли;
КонецПроцедуры // ПолучитьПрефиксСделки()

&НаСервереБезКонтекста
Функция ПолучитьНомерПомещенияНаСервере(Помещение)

	Возврат Помещение.НомерПомещения;	

КонецФункции // ПолучитьПрефикаСделкиНаСервере()


&НаКлиенте
Процедура ПолучитьПрефиксСделки()
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		ПрефиксСделки = ПолучитьПрефикаСделкиНаСервере(Объект.Проект);
	Иначе
		ПрефиксСделки = "";	
	КонецЕсли;
КонецПроцедуры // ПолучитьПрефиксСделки()

&НаСервереБезКонтекста
Функция ПолучитьПрефикаСделкиНаСервере(Сделка)

	Возврат Сделка.Префикс;	

КонецФункции // ПолучитьПрефикаСделкиНаСервере()



&НаКлиенте
Процедура РасписаниеПриИзменении(Элемент)
	//РасписаниеИзменено = Истина;
	//
	//ТД = Элементы.Расписание.ТекущиеДанные;
	//Если ТД = Неопределено Тогда
	//	УчитыватьСтадию = Ложь;
	//Иначе
	//	УчитыватьСтадию = Истина;
	//	текСтадия = ТД.СтадияКонтроль;
	//КонецЕсли;
	//
	//ЭлементыДерева = Расписание.ПолучитьЭлементы();
	//Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
	//	Если НЕ текСтадия = ЭлементДерева.Стадия И УчитыватьСтадию Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	Элементы.Расписание.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);
	//	
	//	Если КолонкаИзменена = "РасписаниеПродолжительность" Тогда
	//		Если УчитыватьСтадию И ЗначениеЗаполнено(ТД.Этап) Тогда
	//			
	//			ЭлементыУр2 = ЭлементДерева.ПолучитьЭлементы();
	//			ВсегоПродолжительность = 0;
	//			Для Каждого ЭлементУр2 Из ЭлементыУр2 Цикл
	//				ВсегоПродолжительность = ВсегоПродолжительность + ЭлементУр2.Продолжительность;
	//			КонецЦикла;
	//			
	//			ВсегоСтрок = ЭлементыУр2.Количество(); 
	//			НомерСтроки = 1;
	//			ВсегоПроцентов = 100;
	//			ЭлементДерева.Процент = ВсегоПроцентов;
	//			ЭлементДерева.Продолжительность = ВсегоПродолжительность;

	//			ЭлементыУр2 = ЭлементДерева.ПолучитьЭлементы();
	//			Для Каждого ЭлементУр2 Из ЭлементыУр2 Цикл
	//				Если ВсегоПродолжительность = 0 Тогда
	//					ЭлементУр2.Процент = 0;
	//					Продолжить;
	//				КонецЕсли;
	//				
	//				Если НомерСтроки = ВсегоСтрок Тогда
	//					текПроцент = ВсегоПроцентов;
	//				Иначе
	//					текПроцент = Окр(ЭлементУр2.Продолжительность / ВсегоПродолжительность * 100, 1, РежимОкругления.Окр15как10);
	//					ВсегоПроцентов = ВсегоПроцентов - текПроцент;
	//					НомерСтроки = НомерСтроки + 1;
	//				КонецЕсли;
	//				ЭлементУр2.Процент = текПроцент;
	//			КонецЦикла;
	//		Иначе
	//			
	//			ЭлементыУр2 = ЭлементДерева.ПолучитьЭлементы();
	//			текПроцент = 0;
	//			НомерСтроки = 1;
	//			ВсегоСтрок = ЭлементыУр2.Количество();
	//			ОстатокПродолжительность = ЭлементДерева.Продолжительность; 
	//			Для Каждого ЭлементУр2 Из ЭлементыУр2 Цикл
	//				текПроцент = текПроцент + ЭлементУр2.Процент;
	//				Если НомерСтроки = ВсегоСтрок Тогда
	//					текПродолжительность = ОстатокПродолжительность;
	//				Иначе
	//					текПродолжительность = Окр(ЭлементДерева.Продолжительность * ЭлементУр2.Процент / 100, 1, РежимОкругления.Окр15как10);
	//					ОстатокПродолжительность = ОстатокПродолжительность - текПродолжительность;
	//					НомерСтроки = НомерСтроки + 1;
	//				КонецЕсли;
	//				ЭлементУр2.Продолжительность = текПродолжительность;
	//			КонецЦикла;
	//			ЭлементДерева.Процент = текПроцент;
	//		КонецЕсли;
	//	ИначеЕсли КолонкаИзменена = "РасписаниеПроцент" Тогда
	//		Если ЗначениеЗаполнено(ТД.Этап) Тогда
	//			ЭлементыУр2 = ЭлементДерева.ПолучитьЭлементы();
	//			
	//			ВсегоПроцентов 			= 0;
	//			ВсегоПродолжительность 	= 0;
	//			
	//			Для Каждого ЭлементУр2 Из ЭлементыУр2 Цикл
	//				ВсегоПроцентов 			= ВсегоПроцентов			+ ЭлементУр2.Процент;
	//				ВсегоПродолжительность 	= ВсегоПродолжительность 	+ ЭлементУр2.Продолжительность;
	//			КонецЦикла;
	//			
	//			ВсегоСтрок 						= ЭлементыУр2.Количество(); 
	//			ЭлементыУр2 					= ЭлементДерева.ПолучитьЭлементы();
	//			НомерСтроки 					= 1;
	//			ЭлементДерева.Процент 			= ВсегоПроцентов;
	//			ЭлементДерева.Продолжительность = ВсегоПродолжительность;
	//			ОстатокПродолжительность 		= ВсегоПродолжительность; 
	//			
	//			Для Каждого ЭлементУр2 Из ЭлементыУр2 Цикл
	//				
	//				Если НомерСтроки = ВсегоСтрок Тогда
	//					текПродолжительность = ОстатокПродолжительность;
	//				Иначе
	//					текПродолжительность 	= Окр(ЭлементУр2.Процент * ВсегоПродолжительность / ?(ВсегоПроцентов = 0,100,ВсегоПроцентов), 1, РежимОкругления.Окр15как10);
	//					ОстатокПродолжительность 	= ОстатокПродолжительность - текПродолжительность;
	//					НомерСтроки = НомерСтроки + 1;
	//				КонецЕсли;
	//				ЭлементУр2.Продолжительность = текПродолжительность;
	//			КонецЦикла;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ТекущийОбъект.Проект) Тогда
		СделкаПрефикс = ТекущийОбъект.Проект.Префикс;	
	Иначе
		СделкаПрефикс = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Проект) Тогда
		НомерПомещения = ТекущийОбъект.Помещения.НомерПомещения;	
	Иначе
		НомерПомещения = "";
	КонецЕсли;

	ТекущийОбъект.Артикул = омИзделиеЭлементНаКлиентеСервере.СобратьАртикулИзДанных(СделкаПрефикс, НомерПомещения, ТекущийОбъект.НомерПоПорядку);
	ТекущийОбъект.Наименование = ТекущийОбъект.Артикул + "." + ТекущийОбъект.НаименованиеБезАртикула;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Если РасписаниеИзменено Тогда
	//	мЭлементы = Новый Массив;
	//	
	//	Объект.РасписаниеПлан.Очистить();
	//	Объект.Стадии.Очистить();
	//	
	//	ЭлементыДерева = Расписание.ПолучитьЭлементы();
	//	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
	//		Элементы.Расписание.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);
	//		Если ЭлементДерева.Продолжительность > 0 Тогда
	//			ЗаполнитьЗначенияСвойств(Объект.Стадии.Добавить(),ЭлементДерева);		
	//		КонецЕсли;
	//		ЭлементыУр2 = ЭлементДерева.ПолучитьЭлементы();
	//		Для Каждого ЭлементУр2 Из ЭлементыУр2 Цикл
	//			мЭлементы.Добавить(Новый Структура("Этап,Процент",ЭлементУр2.Этап,ЭлементУр2.Процент));	
	//		КонецЦикла;
	//	КонецЦикла; 
	//	
	//	Для каждого текЭлемент Из мЭлементы Цикл
	//		ЗаполнитьЗначенияСвойств(Объект.РасписаниеПлан.Добавить(),текЭлемент);		
	//	КонецЦикла;
	//	
	//	РасписаниеИзменено = Ложь;
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеПередНачаломИзменения(Элемент, Отказ)
	ТД = Элементы.Расписание.ТекущиеДанные;

	Если Элемент.ТекущийЭлемент.Имя = "РасписаниеПроцент" Тогда
		Если НЕ ЗначениеЗаполнено(ТД.Этап) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	КолонкаИзменена = Элемент.ТекущийЭлемент.Имя;
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияПриИзменении(Элемент)
	ПолучитьНомерПомещения();
	СформироватьАртикул();
КонецПроцедуры


&НаКлиенте
Функция КонтрольУникальностиНомера()
	
	//СуществующаяСсылка = КонтрольУникальностиНомераСтроки(Объект.Объект,Объект.Ссылка,Объект.НомерСтрокиВФайле,Объект.ДопНомерСтрокиВФайле);
	//Если ЗначениеЗаполнено(СуществующаяСсылка) Тогда
	//	//СтрокаСообщения = "Уже сущетвует изделие """ + СуществующаяСсылка + """ с номером " + Объект.НомерСтрокиВФайле
	//	//+ ?(ЗначениеЗаполнено(Объект.ДопНомерСтрокиВФайле),"." + Объект.ДопНомерСтрокиВФайле,"");
	//	//
	//	//ПоказатьПредупреждение(,СтрокаСообщения);
	//	//
	//	//Возврат Истина;
	//КонецЕсли;
	
	Возврат Ложь;
КонецФункции // КонтрольУникальностиНомера()


&НаСервереБезКонтекста
Функция КонтрольУникальностиНомераСтроки(Объект,Ссылка,НомерСтрокиВФайле,ДопНомерСтрокиВФайле)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ИзделияЗаказчика.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.ИзделияЗаказчика КАК ИзделияЗаказчика
	//|ГДЕ
	//|	ИзделияЗаказчика.ДопНомерСтрокиВФайле = &ДопНомерСтрокиВФайле
	//|	И ИзделияЗаказчика.НомерСтрокиВФайле = &НомерСтрокиВФайле
	//|	И ИзделияЗаказчика.Ссылка <> &Ссылка
	//|	И ИзделияЗаказчика.Объект = &Объект";
	//
	//Запрос.УстановитьПараметр("ДопНомерСтрокиВФайле", ДопНомерСтрокиВФайле);
	//Запрос.УстановитьПараметр("НомерСтрокиВФайле", НомерСтрокиВФайле);
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Запрос.УстановитьПараметр("Объект", Объект);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	Возврат Выборка.Ссылка;
	//КонецЦикла;
	
	Возврат Справочники.ИзделияЭлемент.ПустаяСсылка();
КонецФункции // КонтрольУникальностиНомераСтроки()

#Область СтандартныеПодсистемы_РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти 


&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры           

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура АктуальностьНажатие(Элемент, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтаФорма.ПриложениеКДоговору) Тогда
		ПоказатьЗначение(,ЭтаФорма.ПриложениеКДоговору);
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
